TexasInstruments/f29h85x-sdk/source/driverlib/rtdma.h
//###########################################################################
//
// FILE:   rtdma.h
//
// TITLE:  C29x RTDMA driver
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################


#ifndef RTDMA_H
#define RTDMA_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup rtdma_api RTDMA
//! \brief This module is used for RTDMA configurations.
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_rtdma.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"


#define DMA_TOTAL_MPU     16U  // 16 MPU regions
#define DMA_TOTAL_CH      10U  // 10 channels in each DMA instance

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as part of the config
//! parameter to configure the Oneshot mode.
//
//*****************************************************************************
//! Only one burst transfer performed per trigger.
#define DMA_CFG_ONESHOT_DISABLE     0U
//! Burst transfers occur without additional event triggers after the first.
#define DMA_CFG_ONESHOT_ENABLE      RTDMA_MODE_ONESHOT

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as part of the config
//! parameter to configure the continuous mode of transfer.
//
//*****************************************************************************
//! DMA channel will be disabled at the end of a transfer.
#define DMA_CFG_CONTINUOUS_DISABLE  0U
//! DMA reinitializes when the transfer count is zero and waits for a trigger.
#define DMA_CFG_CONTINUOUS_ENABLE   RTDMA_MODE_CONTINUOUS

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as part of the config
//! parameter to configure the DMA transfer read data size.
//
//*****************************************************************************
#define DMA_CFG_READ_SIZE_8BIT   0x0U       // DMA reads 8 bits at a time.
#define DMA_CFG_READ_SIZE_16BIT  0x20000U   // DMA reads 16 bits at a time.
#define DMA_CFG_READ_SIZE_32BIT  0x40000U   // DMA reads 32 bits at a time.
#define DMA_CFG_READ_SIZE_64BIT  0x60000U   // DMA reads 64 bits at a time.

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as part of the config
//! parameter to configure the DMA write data size.
//
//*****************************************************************************
#define DMA_CFG_WRT_SIZE_8BIT   0x0U        // DMA writes 8 bits at a time.
#define DMA_CFG_WRT_SIZE_16BIT  0x100000U   // DMA writes 16 bits at a time.
#define DMA_CFG_WRT_SIZE_32BIT  0x200000U   // DMA writes 32 bits at a time.
#define DMA_CFG_WRT_SIZE_64BIT  0x300000U   // DMA writes 64 bits at a time.

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as part of the config
//! parameter to configure both the DMA read data size and write data size.
//
//*****************************************************************************
#define DMA_CFG_SIZE_8BIT   (DMA_CFG_READ_SIZE_8BIT | DMA_CFG_WRT_SIZE_8BIT)
#define DMA_CFG_SIZE_16BIT  (DMA_CFG_READ_SIZE_16BIT | DMA_CFG_WRT_SIZE_16BIT)
#define DMA_CFG_SIZE_32BIT  (DMA_CFG_READ_SIZE_32BIT | DMA_CFG_WRT_SIZE_32BIT)
#define DMA_CFG_SIZE_64BIT  (DMA_CFG_READ_SIZE_64BIT | DMA_CFG_WRT_SIZE_64BIT)

//*****************************************************************************
//
//! Values that can be passed to DMA_configMPURegion() as the channel mask to
//! the DMA_MPUConfigParams structure.
//
//*****************************************************************************
#define DMA_MPU_CH1_ENABLE  0x0001U // Enable DMA Channel 1 for the MPU region.
#define DMA_MPU_CH2_ENABLE  0x0002U // Enable DMA Channel 2 for the MPU region.
#define DMA_MPU_CH3_ENABLE  0x0004U // Enable DMA Channel 3 for the MPU region.
#define DMA_MPU_CH4_ENABLE  0x0008U // Enable DMA Channel 4 for the MPU region.
#define DMA_MPU_CH5_ENABLE  0x0010U // Enable DMA Channel 5 for the MPU region.
#define DMA_MPU_CH6_ENABLE  0x0020U // Enable DMA Channel 6 for the MPU region.
#define DMA_MPU_CH7_ENABLE  0x0040U // Enable DMA Channel 7 for the MPU region.
#define DMA_MPU_CH8_ENABLE  0x0080U // Enable DMA Channel 8 for the MPU region.
#define DMA_MPU_CH9_ENABLE  0x0100U // Enable DMA Channel 9 for the MPU region.
#define DMA_MPU_CH10_ENABLE 0x0200U //Enable DMA Channel 10 for the MPU region.


//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as the \e trigger parameter
//
//*****************************************************************************
typedef enum
{
	DMA_TRIGGER_SOFTWARE                    = 0,	//!TRIGGER SOFTWARE
	DMA_TRIGGER_ADCA1		                = 1,	//!TRIGGER ADCA1
	DMA_TRIGGER_ADCA2		                = 2,	//!TRIGGER ADCA2
	DMA_TRIGGER_ADCA3		                = 3,	//!TRIGGER ADCA3
	DMA_TRIGGER_ADCA4		                = 4,	//!TRIGGER ADCA4
	DMA_TRIGGER_ADCAEVT		                = 5,	//!TRIGGER ADCAEVT
	DMA_TRIGGER_ADCB1		                = 6,	//!TRIGGER ADCB1
	DMA_TRIGGER_ADCB2		                = 7,	//!TRIGGER ADCB2
	DMA_TRIGGER_ADCB3		                = 8,	//!TRIGGER ADCB3
	DMA_TRIGGER_ADCB4		                = 9,	//!TRIGGER ADCB4
	DMA_TRIGGER_ADCBEVT		                = 10,	//!TRIGGER ADCBEVT
	DMA_TRIGGER_ADCC1		                = 11,	//!TRIGGER ADCC1
	DMA_TRIGGER_ADCC2		                = 12,	//!TRIGGER ADCC2
	DMA_TRIGGER_ADCC3		                = 13,	//!TRIGGER ADCC3
	DMA_TRIGGER_ADCC4		                = 14,	//!TRIGGER ADCC4
	DMA_TRIGGER_ADCCEVT		                = 15,	//!TRIGGER ADCCEVT
	DMA_TRIGGER_ADCD1		                = 16,	//!TRIGGER ADCD1
	DMA_TRIGGER_ADCD2		                = 17,	//!TRIGGER ADCD2
	DMA_TRIGGER_ADCD3		                = 18,	//!TRIGGER ADCD3
	DMA_TRIGGER_ADCD4		                = 19,	//!TRIGGER ADCD4
	DMA_TRIGGER_ADCDEVT		                = 20,	//!TRIGGER ADCDEVT
	DMA_TRIGGER_ADCE1		                = 21,	//!TRIGGER ADCE1
	DMA_TRIGGER_ADCE2		                = 22,	//!TRIGGER ADCE2
	DMA_TRIGGER_ADCE3		                = 23,	//!TRIGGER ADCE3
	DMA_TRIGGER_ADCE4		                = 24,	//!TRIGGER ADCE4
	DMA_TRIGGER_ADCEEVT		                = 25,	//!TRIGGER ADCEEVT
	DMA_TRIGGER_CPU1_XINT1		            = 31, //!TRIGGER CPU1 XINT1
	DMA_TRIGGER_CPU1_XINT2		            = 32, //!TRIGGER CPU1 XINT2
	DMA_TRIGGER_CPU1_XINT3		            = 33, //!TRIGGER CPU1 XINT3
	DMA_TRIGGER_CPU1_XINT4		            = 34, //!TRIGGER CPU1 XINT4
	DMA_TRIGGER_CPU1_XINT5		            = 35, //!TRIGGER CPU1 XINT5
	DMA_TRIGGER_CPU2_XINT1		            = 36, //!TRIGGER CPU2 XINT1
	DMA_TRIGGER_CPU2_XINT2		            = 37, //!TRIGGER CPU2 XINT2
	DMA_TRIGGER_CPU2_XINT3		            = 38, //!TRIGGER CPU2 XINT3
	DMA_TRIGGER_CPU2_XINT4		            = 39, //!TRIGGER CPU2 XINT4
	DMA_TRIGGER_CPU2_XINT5		            = 40, //!TRIGGER CPU2 XINT5
	DMA_TRIGGER_CPU3_XINT1		            = 41, //!TRIGGER CPU3 XINT1
	DMA_TRIGGER_CPU3_XINT2		            = 42, //!TRIGGER CPU3 XINT2
	DMA_TRIGGER_CPU3_XINT3		            = 43, //!TRIGGER CPU3 XINT3
	DMA_TRIGGER_CPU3_XINT4		            = 44, //!TRIGGER CPU3 XINT4
	DMA_TRIGGER_CPU3_XINT5		            = 45, //!TRIGGER CPU3 XINT5
	DMA_TRIGGER_EPWM1SOCA		            = 46,	//!TRIGGER EPWM1SOCA
	DMA_TRIGGER_EPWM1SOCB		            = 47,	//!TRIGGER EPWM1SOCB
	DMA_TRIGGER_EPWM2SOCA		            = 48,	//!TRIGGER EPWM2SOCA
	DMA_TRIGGER_EPWM2SOCB		            = 49,	//!TRIGGER EPWM2SOCB
	DMA_TRIGGER_EPWM3SOCA		            = 50,	//!TRIGGER EPWM3SOCA
	DMA_TRIGGER_EPWM3SOCB		            = 51,	//!TRIGGER EPWM3SOCB
	DMA_TRIGGER_EPWM4SOCA		            = 52,	//!TRIGGER EPWM4SOCA
	DMA_TRIGGER_EPWM4SOCB		            = 53,	//!TRIGGER EPWM4SOCB
	DMA_TRIGGER_EPWM5SOCA		            = 54,	//!TRIGGER EPWM5SOCA
	DMA_TRIGGER_EPWM5SOCB		            = 55,	//!TRIGGER EPWM5SOCB
	DMA_TRIGGER_EPWM6SOCA		            = 56,	//!TRIGGER EPWM6SOCA
	DMA_TRIGGER_EPWM6SOCB		            = 57,	//!TRIGGER EPWM6SOCB
	DMA_TRIGGER_EPWM7SOCA		            = 58,	//!TRIGGER EPWM7SOCA
	DMA_TRIGGER_EPWM7SOCB		            = 59,	//!TRIGGER EPWM7SOCB
	DMA_TRIGGER_EPWM8SOCA		            = 60,	//!TRIGGER EPWM8SOCA
	DMA_TRIGGER_EPWM8SOCB		            = 61,	//!TRIGGER EPWM8SOCB
	DMA_TRIGGER_EPWM9SOCA		            = 62,	//!TRIGGER EPWM9SOCA
	DMA_TRIGGER_EPWM9SOCB		            = 63,	//!TRIGGER EPWM9SOCB
	DMA_TRIGGER_EPWM10SOCA		            = 64,	//!TRIGGER EPWM10SOCA
	DMA_TRIGGER_EPWM10SOCB		            = 65,	//!TRIGGER EPWM10SOCB
	DMA_TRIGGER_EPWM11SOCA		            = 66,	//!TRIGGER EPWM11SOCA
	DMA_TRIGGER_EPWM11SOCB		            = 67,	//!TRIGGER EPWM11SOCB
	DMA_TRIGGER_EPWM12SOCA		            = 68,	//!TRIGGER EPWM12SOCA
	DMA_TRIGGER_EPWM12SOCB		            = 69,	//!TRIGGER EPWM12SOCB
	DMA_TRIGGER_EPWM13SOCA		            = 70,	//!TRIGGER EPWM13SOCA
	DMA_TRIGGER_EPWM13SOCB		            = 71,	//!TRIGGER EPWM13SOCB
	DMA_TRIGGER_EPWM14SOCA		            = 72,	//!TRIGGER EPWM14SOCA
	DMA_TRIGGER_EPWM14SOCB		            = 73,	//!TRIGGER EPWM14SOCB
	DMA_TRIGGER_EPWM15SOCA		            = 74,	//!TRIGGER EPWM15SOCA
	DMA_TRIGGER_EPWM15SOCB		            = 75,	//!TRIGGER EPWM15SOCB
	DMA_TRIGGER_EPWM16SOCA		            = 76,	//!TRIGGER EPWM16SOCA
	DMA_TRIGGER_EPWM16SOCB		            = 77,	//!TRIGGER EPWM16SOCB
	DMA_TRIGGER_EPWM17SOCA		            = 78,	//!TRIGGER EPWM17SOCA
	DMA_TRIGGER_EPWM17SOCB		            = 79,	//!TRIGGER EPWM17SOCB
	DMA_TRIGGER_EPWM18SOCA		            = 80,	//!TRIGGER EPWM18SOCA
	DMA_TRIGGER_EPWM18SOCB		            = 81,	//!TRIGGER EPWM18SOCB
	DMA_TRIGGER_TINT0		                = 94,	//!TRIGGER CPU1 TINT0
	DMA_TRIGGER_TINT1		                = 95,	//!TRIGGER CPU1 TINT1
	DMA_TRIGGER_TINT2		                = 96,	//!TRIGGER CPU1 TINT2
	DMA_TRIGGER_CPU2_TINT0		            = 97, //!TRIGGER CPU2 TINT0
	DMA_TRIGGER_CPU2_TINT1		            = 98, //!TRIGGER CPU2 TINT1
	DMA_TRIGGER_CPU2_TINT2		            = 99, //!TRIGGER CPU2 TINT2
	DMA_TRIGGER_CPU3_TINT0		            = 100, //!TRIGGER CPU3 TINT0
	DMA_TRIGGER_CPU3_TINT1		            = 101, //!TRIGGER CPU3 TINT1
	DMA_TRIGGER_CPU3_TINT2		            = 102, //!TRIGGER CPU3 TINT2
	DMA_TRIGGER_ECAP1		                = 112, //!TRIGGER ECAP1
	DMA_TRIGGER_ECAP2		                = 113, //!TRIGGER ECAP2
	DMA_TRIGGER_ECAP3		                = 114, //!TRIGGER ECAP3
	DMA_TRIGGER_ECAP4		                = 115, //!TRIGGER ECAP4
	DMA_TRIGGER_ECAP5		                = 116, //!TRIGGER ECAP5
	DMA_TRIGGER_ECAP6		                = 117, //!TRIGGER ECAP6
	DMA_TRIGGER_LINATX		                = 120, //!TRIGGER LINATX
	DMA_TRIGGER_LINARX		                = 121, //!TRIGGER LINARX
	DMA_TRIGGER_LINBTX		                = 122, //!TRIGGER LINBTX
	DMA_TRIGGER_LINBRX		                = 123, //!TRIGGER LINBRX
	DMA_TRIGGER_SYNC		                = 124, //!TRIGGER SYNC
	DMA_TRIGGER_SPIATX		                = 125, //!TRIGGER SPIATX
	DMA_TRIGGER_SPIARX		                = 126, //!TRIGGER SPIARX
	DMA_TRIGGER_SPIBTX		                = 127, //!TRIGGER SPIBTX
	DMA_TRIGGER_SPIBRX		                = 128, //!TRIGGER SPIBRX
	DMA_TRIGGER_SPICTX		                = 129, //!TRIGGER SPICTX
	DMA_TRIGGER_SPICRX		                = 130, //!TRIGGER SPICRX
	DMA_TRIGGER_SPIDTX		                = 131, //!TRIGGER SPIDTX
	DMA_TRIGGER_SPIDRX		                = 132, //!TRIGGER SPIDRX
	DMA_TRIGGER_SPIETX		                = 133, //!TRIGGER SPIETX
	DMA_TRIGGER_SPIERX		                = 134, //!TRIGGER SPIERX
	DMA_TRIGGER_CLB1INT		                = 135, //!TRIGGER CLB1INT
	DMA_TRIGGER_CLB2INT		                = 136, //!TRIGGER CLB2INT
	DMA_TRIGGER_CLB3INT		                = 137, //!TRIGGER CLB3INT
	DMA_TRIGGER_CLB4INT		                = 138, //!TRIGGER CLB4INT
	DMA_TRIGGER_CLB5INT		                = 139, //!TRIGGER CLB5INT
	DMA_TRIGGER_CLB6INT		                = 140, //!TRIGGER CLB6INT
	DMA_TRIGGER_FSITXA		                = 143, //!TRIGGER FSITXA
	DMA_TRIGGER_FSIRXA		                = 144, //!TRIGGER FSIRXA
	DMA_TRIGGER_FSIA_DATA_TAG_MATCH		    = 145, //!TRIGGER FSIA DATA TAG MATCH
	DMA_TRIGGER_FSIA_PING_TAG_MATCH		    = 146, //!TRIGGER FSIA PING TAG MATCH
	DMA_TRIGGER_FSIRXB		                = 148, //!TRIGGER FSIRXB
	DMA_TRIGGER_FSITXB		                = 147, //!TRIGGER FSITXB
	DMA_TRIGGER_FSIB_DATA_TAG_MATCH		    = 149, //!TRIGGER FSIB DATA TAG MATCH
	DMA_TRIGGER_FSIB_PING_TAG_MATCH		    = 150, //!TRIGGER FSIB PING TAG MATCH
	DMA_TRIGGER_FSIRXC		                = 152, //!TRIGGER FSIRXC
	DMA_TRIGGER_FSITXC		                = 151, //!TRIGGER FSITXC
	DMA_TRIGGER_FSIC_DATA_TAG_MATCH		    = 153, //!TRIGGER FSIC DATA TAG MATCH
	DMA_TRIGGER_FSIC_PING_TAG_MATCH		    = 154, //!TRIGGER FSIC PING TAG MATCH
	DMA_TRIGGER_FSITXD		                = 155, //!TRIGGER FSITXD
	DMA_TRIGGER_FSIRXD		                = 156, //!TRIGGER FSIRXD
	DMA_TRIGGER_FSID_DATA_TAG_MATCH		    = 157, //!TRIGGER FSID DATA TAG MATCH
	DMA_TRIGGER_FSID_PING_TAG_MATCH		    = 158, //!TRIGGER FSID PING TAG MATCH
	DMA_TRIGGER_CPU1_DLT		            = 161, //!TRIGGER CPU1 DLT
	DMA_TRIGGER_CPU3_DLT		            = 163, //!TRIGGER CPU3 DLT
	DMA_TRIGGER_CPU2_DLT		            = 162, //!TRIGGER CPU2 DLT
	DMA_TRIGGER_UARTARX		                = 167, //!TRIGGER UARTARX
	DMA_TRIGGER_UARTATX		                = 168, //!TRIGGER UARTATX
	DMA_TRIGGER_UARTBTX		                = 169, //!TRIGGER UARTBTX
	DMA_TRIGGER_UARTBRX		                = 170, //!TRIGGER UARTBRX
	DMA_TRIGGER_UARTCTX		                = 171, //!TRIGGER UARTCTX
	DMA_TRIGGER_UARTCRX		                = 172, //!TRIGGER UARTCRX
	DMA_TRIGGER_UARTDTX		                = 173, //!TRIGGER UARTDTX
	DMA_TRIGGER_UARTDRX		                = 174, //!TRIGGER UARTDRX
	DMA_TRIGGER_UARTETX		                = 175, //!TRIGGER UARTETX
	DMA_TRIGGER_UARTERX		                = 176, //!TRIGGER UARTERX
	DMA_TRIGGER_UARTFTX		                = 177, //!TRIGGER UARTFTX
	DMA_TRIGGER_UARTFRX		                = 178, //!TRIGGER UARTFRX
	DMA_TRIGGER_DTHE_SHA_DMA_S_CTXIN_REQ    = 179, //!TRIGGER DTHE SHA DMA S CTXIN REQ
	DMA_TRIGGER_DTHE_SHA_DMA_S_DATAIN_REQ	= 180, //!TRIGGER DTHE SHA DMA S DATAIN REQ
	DMA_TRIGGER_DTHE_SHA_DMA_S_CTXOUT_REQ	= 181, //!TRIGGER DTHE SHA DMA S CTXOUT REQ
	DMA_TRIGGER_DTHE_SHA_DMA_P_CTXIN_REQ	= 182, //!TRIGGER DTHE SHA DMA P CTXIN REQ
	DMA_TRIGGER_DTHE_SHA_DMA_P_DATAIN_REQ	= 183, //!TRIGGER DTHE SHA DMA P DATAIN REQ
	DMA_TRIGGER_DTHE_SHA_DMA_P_CTXOUT_REQ	= 184, //!TRIGGER DTHE SHA DMA P CTXOUT REQ
	DMA_TRIGGER_DTHE_AES_DMA_S_CTXIN_REQ	= 185, //!TRIGGER DTHE AES DMA S CTXIN REQ
	DMA_TRIGGER_DTHE_AES_DMA_S_DATAIN_REQ	= 186, //!TRIGGER DTHE AES DMA S DATAIN REQ
	DMA_TRIGGER_DTHE_AES_DMA_S_DATAOUT_REQ	= 187, //!TRIGGER DTHE AES DMA S DATAOUT REQ
	DMA_TRIGGER_DTHE_AES_DMA_S_CTXOUT_REQ	= 188, //!TRIGGER DTHE AES DMA S CTXOUT REQ
	DMA_TRIGGER_DTHE_AES_DMA_P_CTXIN_REQ	= 189, //!TRIGGER DTHE AES DMA P CTXIN REQ
	DMA_TRIGGER_DTHE_AES_DMA_P_DATAIN_REQ	= 190, //!TRIGGER DTHE AES DMA P DATAIN REQ
	DMA_TRIGGER_DTHE_AES_DMA_P_DATAOUT_REQ	= 191, //!TRIGGER DTHE AES DMA P DATAOUT REQ
	DMA_TRIGGER_DTHE_AES_DMA_P_CTXOUT_REQ	= 192, //!TRIGGER DTHE AES DMA P CTXOUT REQ
	DMA_TRIGGER_DTHE_SM3_CTXIN_REQ		    = 193, //!TRIGGER DTHE SM3 CTXIN REQ
	DMA_TRIGGER_DTHE_SM3_DATAIN_REQ		    = 194, //!TRIGGER DTHE SM3 DATAIN REQ
	DMA_TRIGGER_DTHE_SM3_CTXOUT_REQ		    = 195, //!TRIGGER DTHE SM3 CTXOUT REQ
	DMA_TRIGGER_DTHE_SM4_CTXIN_REQ		    = 196, //!TRIGGER DTHE SM4 CTXIN REQ
	DMA_TRIGGER_DTHE_SM4_DATAIN_REQ		    = 197, //!TRIGGER DTHE SM4 DATAIN REQ
	DMA_TRIGGER_DTHE_SM4_DATAOUT_REQ	    = 198, //!TRIGGER DTHE SM4 DATAOUT REQ
	DMA_TRIGGER_DTHE_SM4_CTXOUT_REQ		    = 199, //!TRIGGER DTHE SM4 CTXOUT REQ
	DMA_TRIGGER_EPG		                    = 200, //!TRIGGER EPG
	DMA_TRIGGER_SDFM1FLT1		            = 201, //!TRIGGER SDFM1FLT1
	DMA_TRIGGER_SDFM1FLT2		            = 202, //!TRIGGER SDFM1FLT2
	DMA_TRIGGER_SDFM1FLT3		            = 203, //!TRIGGER SDFM1FLT3
	DMA_TRIGGER_SDFM1FLT4		            = 204, //!TRIGGER SDFM1FLT4
	DMA_TRIGGER_SDFM2FLT1		            = 205, //!TRIGGER SDFM2FLT1
	DMA_TRIGGER_SDFM2FLT2		            = 206, //!TRIGGER SDFM2FLT2
	DMA_TRIGGER_SDFM2FLT3		            = 207, //!TRIGGER SDFM2FLT3
	DMA_TRIGGER_SDFM2FLT4		            = 208, //!TRIGGER SDFM2FLT4
	DMA_TRIGGER_SDFM3FLT1		            = 209, //!TRIGGER SDFM3FLT1
	DMA_TRIGGER_SDFM3FLT2		            = 210, //!TRIGGER SDFM3FLT2
	DMA_TRIGGER_SDFM3FLT3		            = 211, //!TRIGGER SDFM3FLT3
	DMA_TRIGGER_SDFM3FLT4		            = 212, //!TRIGGER SDFM3FLT4
	DMA_TRIGGER_SDFM4FLT1		            = 213, //!TRIGGER SDFM4FLT1
	DMA_TRIGGER_SDFM4FLT2		            = 214, //!TRIGGER SDFM4FLT2
	DMA_TRIGGER_SDFM4FLT3		            = 215, //!TRIGGER SDFM4FLT3
	DMA_TRIGGER_SDFM4FLT4		            = 216, //!TRIGGER SDFM4FLT4
	DMA_TRIGGER_SENT1		                = 217, //!TRIGGER SENT1
	DMA_TRIGGER_SENT2		                = 218, //!TRIGGER SENT2
	DMA_TRIGGER_SENT3		                = 219, //!TRIGGER SENT3
	DMA_TRIGGER_SENT4		                = 220, //!TRIGGER SENT4
	DMA_TRIGGER_SENT5		                = 221, //!TRIGGER SENT5
	DMA_TRIGGER_SENT6		                = 222, //!TRIGGER SENT6
	DMA_TRIGGER_WADI1		                = 223, //!TRIGGER WADI1
	DMA_TRIGGER_WADI2		                = 224, //!TRIGGER WADI2
	DMA_TRIGGER_RTDMA_CH1INT		        = 240, //!TRIGGER RTDMA CH1INT
	DMA_TRIGGER_RTDMA_CH2INT		        = 241, //!TRIGGER RTDMA CH2INT
	DMA_TRIGGER_RTDMA_CH3INT		        = 242, //!TRIGGER RTDMA CH3INT
	DMA_TRIGGER_RTDMA_CH4INT		        = 243, //!TRIGGER RTDMA CH4INT
	DMA_TRIGGER_RTDMA_CH5INT		        = 244, //!TRIGGER RTDMA CH5INT
	DMA_TRIGGER_RTDMA_CH6INT		        = 245, //!TRIGGER RTDMA CH6INT
	DMA_TRIGGER_RTDMA_CH7INT		        = 246, //!TRIGGER RTDMA CH7INT
	DMA_TRIGGER_RTDMA_CH8INT		        = 247, //!TRIGGER RTDMA CH8INT
	DMA_TRIGGER_RTDMA_CH9INT		        = 248, //!TRIGGER RTDMA CH9INT
	DMA_TRIGGER_RTDMA_CH10INT		        = 249  //!TRIGGER RTDMA CH10INT
} DMA_Trigger;


//*****************************************************************************
//
//! MPU regions
//
//*****************************************************************************
typedef enum
{
    DMA_MPUR1  = 0,
    DMA_MPUR2  = 1,
    DMA_MPUR3  = 2,
    DMA_MPUR4  = 3,
    DMA_MPUR5  = 4,
    DMA_MPUR6  = 5,
    DMA_MPUR7  = 6,
    DMA_MPUR8  = 7,
    DMA_MPUR9  = 8,
    DMA_MPUR10 = 9,
    DMA_MPUR11 = 10,
    DMA_MPUR12 = 11,
    DMA_MPUR13 = 12,
    DMA_MPUR14 = 13,
    DMA_MPUR15 = 14,
    DMA_MPUR16 = 15
} DMA_MPURegion;


//*****************************************************************************
//
//! DMA channels
//
//*****************************************************************************
typedef enum
{
    DMA_CH1  = 1,
    DMA_CH2  = 2,
    DMA_CH3  = 3,
    DMA_CH4  = 4,
    DMA_CH5  = 5,
    DMA_CH6  = 6,
    DMA_CH7  = 7,
    DMA_CH8  = 8,
    DMA_CH9  = 9,
    DMA_CH10 = 10,
} DMA_Channel;


//*****************************************************************************
//
//! DMA channel prioritites
//
//*****************************************************************************
typedef enum
{
    DMA_CHPRIORITY0,    //! DMA channel has Priority 0.
    DMA_CHPRIORITY1,    //! DMA channel has Priority 1.
    DMA_CHPRIORITY2,    //! DMA channel has Priority 2.
    DMA_CHPRIORITY3     //! DMA channel has Priority 3.
} DMA_ChannelPriority;


//*****************************************************************************
//
//! Values that can be passed to DMA_setInterruptMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! DMA interrupt is generated at the beginning of a transfer
    DMA_INT_AT_BEGINNING,
    //! DMA interrupt is generated at the end of a transfer
    DMA_INT_AT_END
} DMA_InterruptMode;


//*****************************************************************************
//
//! Values that can be passed to DMA_setEmulationMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Transmission stops after current read-write access is completed
    DMA_EMULATION_STOP,
    //! Continue DMA operation regardless of emulation suspend
    DMA_EMULATION_FREE_RUN
} DMA_EmulationMode;


//*****************************************************************************
//
//! Values that can be passed to DMA_setPriorityMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Transmission stops after current read-write access is completed
    DMA_PRIORITY_ROUND_ROBIN,
    //! Continue DMA operation regardless of emulation suspend
    DMA_PRIORITY_SOFTWARE_CONFIG
} DMA_PriorityMode;


//*****************************************************************************
//
//! Values that can be passed to DMA_setBurstMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Burst signaling disabled
    DMA_BURST_SIGNALING_DISABLE  = 0U,
    //! Burst signaling enabled and can't be interrupted (can use with EMIF)
    DMA_BURST_SIGNALING_ENABLE_NO_INT  = 2U,
} DMA_BurstSignalingMode;


//*****************************************************************************
//
//! Values that can be used to define the type of access allowed in a
//! particular MPU region
//
//*****************************************************************************
typedef enum
{
    //! DMA has no access to the MPU region.
    DMA_MPU_NO_ACCESS,
    //! DMA has only read access to the MPU region.
    DMA_MPU_READ_ACCESS,
    //! DMA has both read and write access to the MPU region.
    DMA_MPU_READ_WRITE_ACCESS
} DMA_MPUAccessPermission;


