TexasInstruments/f29h85x-sdk/source/driverlib/rtdma.h
//*****************************************************************************
//
//! Values that can be passed to DMA_configChannel() as the
//! configure parameter.
//
//*****************************************************************************
typedef struct
{
    DMA_Trigger         transferTrigger;  //DMA transfer triggers
    DMA_InterruptMode   interruptMode;    //Channel interrupt mode
    bool                enableInterrupt;  //Enable/Disable interrupt mode
    uint32_t            configSize;       //Data bus width (16 or 32 bits)
    uint32_t            wrtDatasize;      //Size of write accesses
    uint32_t            transferMode;     //Burst transfer mode
    uint32_t            reinitMode;       //DMA reinitialization mode
    uint32_t            channelPriority;  //Priority of the DMA channel
    uint32_t            burstSize;      //Number of words transferred per burst
    uint32_t            transferSize;   //Number of bursts per transfer
    //! Number of bursts to be transferred before a wrap of the source address
    //! occurs.
    uint32_t            srcWrapSize;
    //! Number of bursts to be transferred before a wrap of the destination
    //! address occurs.
    uint32_t            destWrapSize;
    uint32_t            destAddr;         //destination address
    uint32_t            srcAddr;          //source address
    //! Amount to inc or dec the source address after each word of a burst
    int16_t             srcBurstStep;
    //! Amount to inc or dec the destination address after each word of a burst
    int16_t             destBurstStep;
    //! Amount to inc or dec the source address after each burst of a transfer
    int16_t             srcTransferStep;
    //! Amount to inc or dec the destination address after each burst of a
    //! transfer
    int16_t             destTransferStep;
    //! Amount to inc or dec the source address when the wrap occurs
    int16_t             srcWrapStep;
    //! Amount to inc or dec the destination address when the wrap occurs
    int16_t             destWrapStep;

} DMA_ConfigParams;


//*****************************************************************************
//
//! Values that can be passed to DMA_configMPURegion() as the configure
//! parameter.
//! The startAddr is the beginning address of the 4KB granular block, whose
//! least 12 bits are 0's.
//! The endAddr denotes the end of the granular region and the least 12 bits
//! are 1's (0xFFF)
//
//*****************************************************************************
typedef struct
{
    //! MPU region start address (granularity of 4KB)
    uint32_t                 startAddr;
    //! MPU region end address (end of the 4KB granular region)
    uint32_t                 endAddr;
    //! Enable/ disable specific channel accesses using channel mask bits. It
    //! can be OR of the DMA_MPU_CH(#)_ENABLE macros
    uint16_t                 channelMask;
    //! Region access permissions
    DMA_MPUAccessPermission  accessPermission;
} DMA_MPUConfigParams;



//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an DMA channel base address.
//!
//! \param base specifies the DMA channel base address.
//!
//! This function determines if a DMA channel base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
DMA_isBaseValid(uint32_t base)
{
    //
    // Check if the base address of the 2 RTDMA instance is valid
    //
    return(
           (base == RTDMA1_BASE) ||
           (base == RTDMA2_BASE)
          );
}

static inline bool
DMA_MPU_isBaseValid(uint32_t base)
{
    //
    // Check if the base address of the MPU registers is valid
    //
    return(
           (base == RTDMA1_MPU_BASE) ||
           (base == RTDMA2_MPU_BASE)
          );
}

static inline bool
DMA_CH_isBaseValid(uint32_t base)
{
    //
    // Check if the base address of the DMA channel control registers is valid
    //
    return(
           ((base & BASE_ADDR_MASK) == RTDMA1CH1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH3_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH4_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH5_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH6_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH7_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH8_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH9_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA1CH10_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH1_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH2_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH3_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH4_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH5_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH6_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH7_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH8_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH9_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == RTDMA2CH10_BASE_FRAME(0U))
          );
}
#endif


//*****************************************************************************
//
//! Initializes the DMA controller to a known state.
//!
//! \param base specifies the base address DMA configuration registers.
//!
//! This function does a hard reset of the DMA controller in order to put it
//! into a known state. The function also sets the DMA to run free during
//! an emulation suspend (see the field DEBUGCTRL.FREE for more info).
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_initController")))
static inline void
DMA_initController(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set the hard reset bit. One NOP is required after HARDRESET.
    //
    HWREGB(base + RTDMA_O_DMACTRL) = RTDMA_DMACTRL_HARDRESET;
    NOP;
}


//*****************************************************************************
//
//! Channel Soft Reset
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function does a soft reset to place the channel into its default state
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_triggerSoftReset(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set the soft reset bit. One NOP is required after SOFTRESET
    //
    HWREGB(base + RTDMA_O_CONTROL) = RTDMA_CONTROL_SOFTRESET;    // HWREGH
    NOP;
}


//*****************************************************************************
//
//! Sets DMA emulation mode.
//!
//! \param base specifies the base address of the DMA configuration registers.
//! \param mode is the emulation mode to be selected.
//!
//! This function sets the behavior of the DMA operation when an emulation
//! suspend occurs. The \e mode parameter can be one of the following:
//!
//! - \b DMA_EMULATION_STOP - DMA runs until the current read-write access
//!   is completed.
//! - \b DMA_EMULATION_FREE_RUN - DMA operation continues regardless of a
//!   the suspend.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_setEmulationMode")))
static inline void
DMA_setEmulationMode(uint32_t base, DMA_EmulationMode mode)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set Emulation mode
    //
    if(mode == DMA_EMULATION_STOP)
    {
        HWREGH(base + RTDMA_O_DEBUGCTRL) &= ~(uint16_t)RTDMA_DEBUGCTRL_FREE;
    }
    else
    {
        HWREGH(base + RTDMA_O_DEBUGCTRL) |= (uint16_t)RTDMA_DEBUGCTRL_FREE;
    }
}


//*****************************************************************************
//
//! Sets the DMA channel priority mode.
//!
//! \param base specifies the base address of the DMA configuration registers.
//! \param priorityMode is the channel priority mode to be selected.
//!
//! This function sets the channel priority mode. The \e priorityMode
//! parameter can be one of the following:
//!
//! - \b DMA_PRIORITY_ROUND_ROBIN - DMA channels are serviced in round-robin
//! mode. This is the default behavior.
//! - \b DMA_PRIORITY_SOFTWARE_CONFIG - Priority for channels are software
//! configurable. The priority of the channels is set in the SWPRI registers.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_setPriorityMode")))
static inline void
DMA_setPriorityMode(uint32_t base, DMA_PriorityMode priorityMode)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set Priority mode
    //
    if(priorityMode == DMA_PRIORITY_SOFTWARE_CONFIG)
    {
        HWREG(base + RTDMA_O_DMACTRL) |= RTDMA_DMACTRL_PRIORITYSEL;
    }
    else
    {
        HWREG(base + RTDMA_O_DMACTRL) &= ~RTDMA_DMACTRL_PRIORITYSEL;
    }
}


//*****************************************************************************
//
//! Sets the DMA channel priority
//!
//! \param base is the base address of the DMA configuration registers.
//! \param channel is the corresponding DMA channel number.
//! \param chPriority is the priority to be assigned to the channel.
//!
//! This function sets the priority of the DMA channel. Priority can be set to
//! any value of 0x0 to 0x3. Default value is 1 and value of 0 is treated as a
//! special condition during arbitration.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_setChannelPriority")))
static inline void
DMA_setChannelPriority(uint32_t base, DMA_Channel channel,
                               DMA_ChannelPriority chPriority)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));
    if((uint8_t)channel < 9U)
    {
        HWREG(base + RTDMA_O_SWPRI1) =  (HWREG(base + RTDMA_O_SWPRI1) &
                    ~(0xFU << (4U * ((uint32_t)channel - 1U)))) |
                    ((uint32_t)chPriority << (4U * ((uint32_t)channel - 1U)));
    }
    else
    {
        HWREG(base + RTDMA_O_SWPRI2) =  (HWREG(base + RTDMA_O_SWPRI2) &
                    ~(0xFU << (4U * ((uint32_t)channel - 9U)))) |
                    ((uint32_t)chPriority << (4U * ((uint32_t)channel - 9U)));
    }
}


//*****************************************************************************
//
//! Resets the DMA channel priority.
//!
//! \param base specifies the base address of the DMA configuration registers.
//!
//! If PRIORITYSEL==0: The priority reset bit resets the round-robin state
//! machine when a 1 is written. Service starts from the first enabled
//! channel. Writes of 0 are ignored and this bit always reads back a 0.
//!
//! If PRIORITYSEL==1: The SWPRI register is reset to it's reset value when a
//! 1 is written. All channels will be of priority "1". Writes of 0 are
//! ignored and this bit always reads back a 0.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_resetPriority")))
static inline void
DMA_resetPriority(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set the Priority reset bit
    //
    HWREGB(base + RTDMA_O_DMACTRL) = RTDMA_DMACTRL_PRIORITYRESET;
}


//*****************************************************************************
//
//! Enables peripherals to trigger a DMA transfer.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function enables the selected peripheral trigger to start a DMA
//! transfer on the specified channel.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_enableTrigger(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set the peripheral interrupt trigger enable bit.
    //
    HWREGH(base + RTDMA_O_MODE) |= RTDMA_MODE_PERINTE;
}


//*****************************************************************************
//
//! Disables peripherals from triggering a DMA transfer.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function disables the selected peripheral trigger from starting a DMA
//! transfer on the specified channel. This also disables the use of the
//! software force using the DMA_forceTrigger() API.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_disableTrigger(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Clear the peripheral interrupt trigger enable bit.
    //
    HWREGH(base + RTDMA_O_MODE) &= ~RTDMA_MODE_PERINTE;
}


//*****************************************************************************
//
//! Force a peripheral trigger to a DMA channel.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function sets the peripheral trigger flag and if triggering a DMA
//! burst is enabled (see DMA_enableTrigger()), a DMA burst transfer will be
//! forced.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_forceTrigger(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set the peripheral interrupt trigger force bit.
    //
    HWREGB(base + RTDMA_O_CONTROL) = RTDMA_CONTROL_PERINTFRC;
}


//*****************************************************************************
//
//! Clears a DMA channel's peripheral trigger flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function clears the peripheral trigger flag. Normally, you would use
//! this function when initializing the DMA for the first time. The flag is
//! cleared automatically when the DMA starts the first burst of a transfer.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_clearTriggerFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Write a one to the clear bit to clear the peripheral trigger flag.
    //
    HWREGB(base + RTDMA_O_CONTROL) = RTDMA_CONTROL_PERINTCLR;
}


//*****************************************************************************
//
//! Gets the status of a DMA channel's Transfer Status Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Transfer Status Flag is set, which
//! means a DMA transfer has begun.
//! This flag is cleared when TRANSFER_COUNT reaches zero, or when the
//! HARDRESET or SOFTRESET bit is set.
//!
//! \return Returns \b true if the Transfer Status Flag is set. Returns
//! \b false otherwise.
//
//*****************************************************************************
static inline bool
DMA_getTransferStatusFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Read the Transfer Status Flag and return appropriately.
    //
    return((HWREGH(base + RTDMA_O_CONTROL) & RTDMA_CONTROL_TRANSFERSTS) != 0U);
}


//*****************************************************************************
//
//! Gets the status of a DMA channel's Burst Status Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Burst Status Flag is set, which
//! means a DMA burst has begun.
//! This flag is cleared when BURST_COUNT reaches zero, or when the
//! HARDRESET or SOFTRESET bit is set.
//!
//! \return Returns \b true if the Burst Status Flag is set. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getBurstStatusFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Read the Burst Status Flag and return appropriately.
    //
    return((HWREGH(base + RTDMA_O_CONTROL) & RTDMA_CONTROL_BURSTSTS) != 0U);
}


//*****************************************************************************
//
//! Gets the status of a DMA channel's Run Status Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Run Status Flag is set, which
//! means the DMA channel is enabled.
//! This flag is cleared when a transfer completes (TRANSFER_COUNT = 0) and
//! continuous mode is disabled, or when the HARDRESET, SOFTRESET, or HALT bit
//! is set.
//!
//! \return Returns \b true if the channel is enabled. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getRunStatusFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Read the Run Status Flag and return appropriately.
    //
    return((HWREGH(base + RTDMA_O_CONTROL) & RTDMA_CONTROL_RUNSTS) != 0U);
}


//*****************************************************************************
//
//! Gets the status of a DMA channel's Overflow Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Overflow Flag is set, which
//! means peripheral event trigger was received while Peripheral Event Trigger
//! Flag was already set.
//! This flag can be cleared by writing to ERRCLR bit, using the function
//! DMA_clearErrorFlag().
//!
//! \return Returns \b true if the channel is enabled. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getOverflowFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Read the Overflow Flag and return appropriately.
    //
    return((HWREGH(base + RTDMA_O_CONTROL) & RTDMA_CONTROL_OVRFLG) != 0U);
}


//*****************************************************************************
//
//! Gets the status of a DMA channel's peripheral trigger flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if a peripheral trigger event has occurred
//! The flag is automatically cleared when the first burst transfer begins, but
//! if needed, it can be cleared using DMA_clearTriggerFlag().
//!
//! \return Returns \b true if a peripheral trigger event has occurred and its
//! flag is set. Returns \b false otherwise.
//
//*****************************************************************************
static inline bool
DMA_getTriggerFlagStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Read the peripheral trigger flag and return appropriately.
    //
    return((HWREGH(base + RTDMA_O_CONTROL) & RTDMA_CONTROL_PERINTFLG) != 0U);
}


//*****************************************************************************
//
//! Starts a DMA channel.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function starts the DMA running, typically after you have configured
//! it. It will wait for the first trigger event to start operation. To halt
//! the channel use DMA_stopChannel().
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_startChannel(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set the run bit.
    //
    HWREGB(base + RTDMA_O_CONTROL) = RTDMA_CONTROL_RUN;
}


//*****************************************************************************
//
//! Halts a DMA channel.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function halts the DMA at its current state and any current read-write
//! access is completed. To start the channel again use DMA_startChannel().
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_stopChannel(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set the halt bit.
    //
    HWREGB(base + RTDMA_O_CONTROL) = RTDMA_CONTROL_HALT;
}


//*****************************************************************************
//
//! Sets the interrupt generation mode of a DMA channel interrupt.
//!
//! \param base is the base address of the DMA channel control registers.
//! \param mode is a flag to indicate the channel interrupt mode.
//!
//! This function sets the channel interrupt mode. When the \e mode parameter
//! is
//! - \b DMA_INT_AT_END, the DMA channel interrupt will be generated at the
//! end of the transfer.
//! - \b DMA_INT_AT_BEGINNING, the interrupt will be generated at the
//! beginning of a new transfer. Generating at the beginning of a new
//! transfer is the default behavior.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_setInterruptMode(uint32_t base, DMA_InterruptMode mode)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Write the selected interrupt generation mode to the register.
    //
    if(mode == DMA_INT_AT_END)
    {
        HWREG(base + RTDMA_O_MODE) |= RTDMA_MODE_CHINTMODE;
    }
    else
    {
        HWREG(base + RTDMA_O_MODE) &= ~RTDMA_MODE_CHINTMODE;
    }
}


//*****************************************************************************
//
//! Enables a DMA channel interrupt source.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function enables the indicated DMA channel;s CPU interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_enableInterrupt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Enable the specified DMA channel interrupt.
    //
    HWREG(base + RTDMA_O_MODE) |= RTDMA_MODE_CHINTE;
}


//*****************************************************************************
//
//! Disables a DMA channel interrupt source.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function disables the indicated DMA channel's CPU interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_disableInterrupt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Disable the specified DMA channel interrupt.
    //
    HWREG(base + RTDMA_O_MODE) &= ~RTDMA_MODE_CHINTE;
}


