TexasInstruments/f29h85x-sdk/source/driverlib/rtdma.h
//*****************************************************************************
//
//! Locks the DMA configuration registers
//!
//! \param base is the base address of the DMA configuration registers.
//!
//! The configuration registers in the RTDMA_REGS apeture DMACTRL, DEBUGCTRL,
//! SWPRI1/2 are locked (writes will have no effect on them).
//! This can only be done if DMACFG_COMMIT.COMMIT is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_lockDMAConfig")))
static inline void
DMA_lockDMAConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Lock DMA configuration
    //
    HWREGB(base + RTDMA_O_DMACFG_LOCK) = RTDMA_DMACFG_LOCK_LOCK;
}


//*****************************************************************************
//
//! Unlocks DMA configuration registers
//!
//! \param base is the base address of the DMA configuration registers.
//!
//! The configuration registers in the RTDMA_REGS apeture DMACTRL, DEBUGCTRL,
//! SWPRI1/2 are unlocked and can be modified.
//! This can only be done if DMACFG_COMMIT.COMMIT is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_unlockDMAConfig")))
static inline void
DMA_unlockDMAConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Unlock DMA configuration, if not committed
    //
    HWREGB(base + RTDMA_O_DMACFG_LOCK) = 0U;
}


//*****************************************************************************
//
//! Commits the DMA configuration registers
//!
//! \param base is the base address of the DMA configuration registers.
//!
//! This function commits the lock on the DMA configuration registers.
//! Once committed, it cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_commitDMAConfig")))
static inline void
DMA_commitDMAConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Commit the lock on the DMA configuration registers
    //
    HWREGB(base + RTDMA_O_DMACFG_COMMIT) = RTDMA_DMACFG_COMMIT_COMMIT;
}


//*****************************************************************************
//
//! Enables the DMA channel overrun interrupt.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function enables the indicated DMA channel's ability to generate an
//! interrupt upon the detection of an overrun. An overrun is when a peripheral
//! event trigger is received by the DMA before a previous trigger on that
//! channel had been serviced and its flag had been cleared.
//!
//! Note that this is the same interrupt signal as the interrupt that gets
//! generated at the beginning/end of a transfer. That interrupt must first be
//! enabled using DMA_enableInterrupt() in order for the overrun interrupt to
//! be generated.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_enableOverrunInterrupt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Enable the specified DMA channel interrupt.
    //
    HWREGH(base + RTDMA_O_MODE) |= RTDMA_MODE_OVRINTE;
}


//*****************************************************************************
//
//! Disables the DMA channel overrun interrupt.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function disables the indicated DMA channel's ability to generate an
//! interrupt upon the detection of an overrun.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_disableOverrunInterrupt(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Disable the specified DMA channel interrupt.
    //
    HWREGH(base + RTDMA_O_MODE) &= ~(uint16_t)RTDMA_MODE_OVRINTE;
}


//*****************************************************************************
//
//! Clears the DMA channel error flags.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function clears both the DMA channel's sync error flag and its
//! overrun error flag.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_clearErrorFlag(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Write to the error clear bit
    //
    HWREGB(base + RTDMA_O_CONTROL) = RTDMA_CONTROL_ERRCLR;
}


//*****************************************************************************
//
//! Configures the source address for the DMA channel
//!
//! \param base is the base address of the DMA channel control registers.
//! \param *srcAddr is a source address.
//!
//! This function configures the source address of a DMA channel.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_configSourceAddress(uint32_t base, const void *srcAddr)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set up SOURCE address.
    //
    HWREG(base + RTDMA_O_SRC_BEG_ADDR_SHADOW) = (uint32_t)srcAddr;
    HWREG(base + RTDMA_O_SRC_ADDR_SHADOW)     = (uint32_t)srcAddr;
}


//*****************************************************************************
//
//! Configures the destination address for the DMA channel
//!
//! \param base is the base address of the DMA channel control registers.
//! \param *destAddr is the destination address.
//!
//! This function configures the destinaton address of a DMA channel.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_configDestAddress(uint32_t base, const void *destAddr)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Set up DESTINATION address.
    //
    HWREG(base + RTDMA_O_DST_BEG_ADDR_SHADOW) = (uint32_t)destAddr;
    HWREG(base + RTDMA_O_DST_ADDR_SHADOW)     = (uint32_t)destAddr;
}


//*****************************************************************************
//
//! Configures the modes supported during burst operation
//!
//! \param base is the base address of the DMA channel control registers.
//! \param mode is the mode
//!
//! This function configures the modes supported during burst operation. The
//! Burst signaling can be enabled/ disabled. If enabled, it can be configured
//! to be interrupted or not be interrupted.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_setBurstSignalingMode(uint32_t base, DMA_BurstSignalingMode mode)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Configure the Burst mode operation
    //
    HWREGB(base + RTDMA_O_BURST_INTF_CTRL) = (uint8_t)mode;

