TexasInstruments/f29h85x-sdk/source/driverlib/rtdma.h
}


//*****************************************************************************
//
//! Locks the channel configuration registers of all DMA channels
//!
//! \param base is the base address of the first DMA channel control registers.
//!
//! The configuration registers of all the channels are locked
//! (writes will have no effect on them).
//! This can only be done if the corresponding CHCFG_COMMIT.COMMIT is cleared.
//!
//! This function locks the configuration registers of all the DMA channels
//!
//! \return None
//
//*****************************************************************************
static inline void
DMA_lockAllChannelConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    uint8_t i;
    uint32_t base_ch;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_CH; i++)
    {
        base_ch = base + (0x1000U * i);

        //
        // Lock the DMA channel configuration.
        //
        HWREGB(base_ch + RTDMA_O_CHCFG_LOCK) = RTDMA_CHCFG_LOCK_LOCK;
    }
}


//*****************************************************************************
//
//! Unlocks the channel configuration registers of all DMA channels.
//!
//! \param base is the base address of the first DMA channel control registers.
//!
//! The configuration registers of the specified channel are unlocked and
//! can be modified.
//! This can only be done if CHCFG_COMMIT.COMMIT is cleared.
//!
//! This function unlocks the DMA configuration registers.
//!
//! \return None
//
//*****************************************************************************
static inline void
DMA_unlockAllChannelConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT((base == RTDMA1CH1_BASE) || (base == RTDMA2CH1_BASE));

    uint8_t i;
    uint32_t base_ch;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_CH; i++)
    {
        base_ch = base + (0x1000U * i);
        ASSERT(DMA_CH_isBaseValid(base_ch));

        //
        // Unlock the DMA channel configuration.
        //
        HWREGB(base_ch + RTDMA_O_CHCFG_LOCK) = 0U;
    }
}


//*****************************************************************************
//
//! Commits the channel configuration registers of all DMA channels
//!
//! \param base is the base address of the first DMA channel control registers.
//!
//! This function commits the lock on the corresponding DMA channel
//! configuration registers.
//! Once committed, it cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
static inline void
DMA_commitAllChannelConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    uint32_t i;
    uint32_t base_ch;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_CH; i++)
    {
        base_ch = base + (0x1000U * i);
        ASSERT(DMA_CH_isBaseValid(base_ch));

        //
        // Commit the DMA channel configuration.
        //
        HWREGB(base_ch + RTDMA_O_CHCFG_COMMIT) = RTDMA_CHCFG_COMMIT_COMMIT;
    }
}


//*****************************************************************************
//
//! Locks the DMA channel configuration registers
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! The configuration registers of the specified channel are locked
//! (writes will have no effect on them).
//! This will only be done if CHCFG_COMMIT.COMMIT is cleared.
//!
//! This function locks the DMA channel configuration registers
//!
//! \return None
//
//*****************************************************************************
static inline void
DMA_lockChannelConfig(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Lock the DMA channel configuration.
    //
    HWREGB(base + RTDMA_O_CHCFG_LOCK) = RTDMA_CHCFG_LOCK_LOCK;
}


//*****************************************************************************
//
//! Unlocks the DMA channel configuration registers.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! The configuration registers of the specified channel are unlocked and
//! can be modified.
//! This can only be done if CHCFG_COMMIT.COMMIT is cleared.
//!
//! This function unlocks the DMA configuration registers.
//!
//! \return None
//
//*****************************************************************************
static inline void
DMA_unlockChannelConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Unlock DMA channel configuration
    //
    HWREGB(base + RTDMA_O_CHCFG_LOCK) = 0U;
}


//*****************************************************************************
//
//! Commits the DMA channel configuration registers
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function commits the lock on the corresponding DMA channel
//! configuration registers. Once committed, cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
static inline void
DMA_commitChannelConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_CH_isBaseValid(base));

    //
    // Commit the lock on the DMA channel configuration registers
    //
    HWREGB(base + RTDMA_O_CHCFG_COMMIT) = RTDMA_CHCFG_COMMIT_COMMIT;
}


//*****************************************************************************
//
//! Enables the MPU function
//!
//! \param base is the base address of the MPU registers.
//!
//! This function enables the MPU function. It can be executed by SROOT only.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_enableMPU")))
static inline void
DMA_enableMPU(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Set the MPU function enable bit.
    //
    HWREGB(base + RTDMA_O_MPUCTRL) |= RTDMA_MPUCTRL_MPUEN;
}


//*****************************************************************************
//
//! Disables the MPU function
//!
//! \param base is the base address of the MPU registers.
//!
//! This function disables the MPU function. It can be executed by SROOT only.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_disableMPU")))
static inline void
DMA_disableMPU(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Set the MPU function enable bit.
    //
    HWREGB(base + RTDMA_O_MPUCTRL) &= ~RTDMA_MPUCTRL_MPUEN;
}


//*****************************************************************************
//
//! Locks the MPU configuration register
//!
//! \param base is the base address of the MPU registers.
//!
//! The MPU configuration register MPUCTRL is locked (writes will have no
//! effect on them). This is only done if MPUCFG_COMMIT.COMMIT is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_lockMPUConfig")))
static inline void
DMA_lockMPUConfig(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Lock the MPU region configuration.
    //
    HWREGB(base + RTDMA_O_MPUCFG_LOCK) = RTDMA_MPUCFG_LOCK_LOCK;
}


//*****************************************************************************
//
//! Unlocks the MPU configuration register
//!
//! \param base is the base address of the MPU registers.
//!
//! The MPU configuration register MPUCTRL is unlocked.
//! This can only be done if MPUCFG_COMMIT.COMMIT is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_unlockMPUConfig")))
static inline void
DMA_unlockMPUConfig(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Unlock the MPU configuration
    //
    HWREGB(base + RTDMA_O_MPUCFG_LOCK) = 0U;
}


//*****************************************************************************
//
//! Commits the MPU configuration register.
//!
//! \param base is the base address of the MPU registers.
//!
//! This function commits the lock on the corresponding MPU configuration
//! register. Once committed, it cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_commitMPUConfig")))
static inline void
DMA_commitMPUConfig(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Commit the lock on the MPU configuration.
    //
    HWREGB(base + RTDMA_O_MPUCFG_COMMIT) = RTDMA_MPUCFG_COMMIT_COMMIT;
}


//*****************************************************************************
//
//! Locks the registers of all MPU regions
//!
//! \param base is the base address of the MPU registers.
//!
//! The configuration registers of all the MPU regions are locked
//! (writes will have no effect on them).
//! This can only be done if the corresponding COMMIT bit is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_lockAllMPURegion")))
static inline void
DMA_lockAllMPURegion(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    uint8_t i;

