TexasInstruments/f29h85x-sdk/source/driverlib/rtdma.h
    for (i = 0U; i < (uint8_t)DMA_TOTAL_MPU; i++)
    {
        //
        // Lock the MPU configuration
        //
        HWREGB(base + RTDMA_O_MPUR_LOCK(i)) = 1U;
    }
}


//*****************************************************************************
//
//! Unlocks the registers of all MPU regions
//!
//! \param base is the base address of the MPU registers.
//!
//! The configuration registers of all the MPU regions are unlocked
//! This can only be done if the corresponding COMMIT bit is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_unlockAllMPURegion")))
static inline void
DMA_unlockAllMPURegion(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_MPU_isBaseValid(base));
    uint8_t i;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_MPU; i++)
    {

        //
        // Unlock the MPU configuration
        //
        HWREGB(base + RTDMA_O_MPUR_LOCK(i)) = 0U;
    }
}


//*****************************************************************************
//
//! Commits the registers of all MPU regions.
//!
//! \param base is the base address of the MPU registers.
//!
//! This function commits the lock on the corresponding MPU region
//! configuration registers.
//! Once committed, it cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_commitAllMPURegion")))
static inline void
DMA_commitAllMPURegion(uint32_t base)
{
    //
    // Check the arguments
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    uint8_t i;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_MPU; i++)
    {
        //
        // Commit the lock on the MPU registers.
        //
        HWREGB(base + RTDMA_O_MPUR_COMMIT(i)) = 1U;
    }
}


//*****************************************************************************
//
//! Locks the registers of an MPU region.
//!
//! \param base is the base address of the MPU registers.
//! \param MPURegion is the MPU region number.
//!
//! The configuration registers of the specific MPU region is locked
//! (writes will have no effect on them).
//! This can only be done if the corresponding COMMIT bit is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_lockMPURegion")))
static inline void
DMA_lockMPURegion(uint32_t base, DMA_MPURegion MPURegion)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Lock the MPU region registers.
    //
    HWREGB(base + RTDMA_O_MPUR_LOCK((uint32_t)MPURegion)) = 1U;
}


//*****************************************************************************
//
//! Unocks the registers of an MPU region.
//!
//! \param base is the base address of the MPU registers.
//! \param MPURegion is the MPU region number.
//!
//! The configuration registers of the specific MPU region is unlocked
//! This can only be done if the corresponding COMMIT bit is cleared.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_unlockMPURegion")))
static inline void
DMA_unlockMPURegion(uint32_t base, DMA_MPURegion MPURegion)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Unlock the MPU region registers.
    //
    HWREGB(base + RTDMA_O_MPUR_LOCK((uint32_t)MPURegion)) = 0U;
}


//*****************************************************************************
//
//! Commits the MPU region configuration registers
//!
//! \param base is the base address of the MPU registers.
//! \param MPURegion is the MPU region number.
//!
//! This function commits the lock on the corresponding MPU registers.
//! Once committed, it cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_commitMPURegion")))
static inline void
DMA_commitMPURegion(uint32_t base, DMA_MPURegion MPURegion)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_MPU_isBaseValid(base));

    //
    // Commit the lock on MPU registers.
    //
    HWREGB(base + RTDMA_O_MPUR_COMMIT((uint32_t)MPURegion)) = 1U;
}


//*****************************************************************************
//
//! Commits all the DMA module configurations including the DMA configuration
//! registers, all the channel configuration, MPU configuration and all MPU
//! region configuration registers.
//!
//! This function commits the lock on the corresponding configuration registers
//! Once committed, it cannot be revoked except by reset.
//!
//! \return None
//
//*****************************************************************************
__attribute__((section(".text.link2.DMA_commitAllDMASettings")))
static inline void
DMA_commitAllDMASettings(void)
{
    //
    // Commit the DMA configuration.
    //
    HWREGB(RTDMA1_BASE + RTDMA_O_DMACFG_COMMIT) = 0x1U;
    HWREGB(RTDMA2_BASE + RTDMA_O_DMACFG_COMMIT) = 0x1U;

    uint8_t i;
    uint32_t base;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_CH; i++)
    {
        base = RTDMA1CH1_BASE + (0x1000U * i);
        ASSERT(DMA_CH_isBaseValid(base));
        //
        // Commit the RTDMA1 channel configuration.
        //
        HWREGB(base + RTDMA_O_CHCFG_COMMIT) = 0x1U;
    }

    for (i = 0U; i < (uint8_t)DMA_TOTAL_CH; i++)
    {
        base = RTDMA2CH1_BASE + (0x1000U * i);
        ASSERT(DMA_CH_isBaseValid(base));
        //
        // Commit the RTDMA2 channel configuration.
        //
        HWREGB(base + RTDMA_O_CHCFG_COMMIT) = 0x1U;
    }

    //
    // Commit the MPU configuration.
    //
    HWREGB(RTDMA1_MPU_BASE + RTDMA_O_MPUCFG_COMMIT) = 0x1U;
    HWREGB(RTDMA2_MPU_BASE + RTDMA_O_MPUCFG_COMMIT) = 0x1U;

    for (i = 0U; i < (uint8_t)DMA_TOTAL_MPU; i++)
    {
        //
        // Commit the RTDMA1 MPU regions configuration.
        //
        HWREGB(RTDMA1_MPU_BASE + RTDMA_O_MPUR_COMMIT(i)) = 0x1U;
    }

